/*1. Умовні конструкції: 
Написати код, який буде:
Запитати в користувача його вік:
Якщо вік більший 7 і менший 17
	Запитати в користувача ім’я
		Якщо ввів:
			Вивести “Доброго дня, <name>”
		Інакше вивести “Допобачення”
Інакше вивести “Ви народились не в 2000х”*/

var age = parseInt(prompt("Скільки Вам років?", "0"));
if (age > 7 && age < 17){
	var name = prompt("Ваше ім’я?", "");
	if (name){
		alert ("Доброго дня, " + name);
	} else {
		alert ("Допобачення");
	}
} else {
		alert("Ви народились не в 2000х");
	}


/*2. Без запуску коду написати, що виведеться і обгрунтувати

|| - оператор ИЛИ вычисляет ровно столько значений, сколько необходимо – до первого true
если все ложные – то последнее значение
&& возвращает true, если оба аргумента истинны, а иначе – false
Если левый аргумент – false, && возвращает его и заканчивает вычисления.
Иначе – вычисляет и возвращает правый аргумент.
Если несколько значений подряд, возвратится первое «ложное» 
(на котором остановились вычисления), а если его нет – то последнее


alert(null || 2 || undefined)  // 2 (2 - true; null и undefined - false)
alert(alert(213) || 2 || alert(324)) // 213, 2 (alert(324) - проигнорируется, т.к. перед ним 2 - true; )
alert(13123 && null && 2) // null
alert(alert(1) && alert(2)) // 1, undefined (typeof(alert(2)) - undefined, false)
alert(null || 2 && 3 || 4) // 3

if(-1 || 0) alert ("first") // first (т.к. -1 - true, условие выполнилось)
if(-1 && 0) alert ("second") //    (-1 - true, 0 - false, для && оба аргумента должны быть true)


3. Без запуску коду, написати і обгрунтувати результат

"" + 123 + 0 // 1230 (тип результата - строка, конкатенация; Если хотя бы один аргумент является строкой, остальные будут преобразованы к строке)
"" - 143 + 0 // -143 (тип результата - число, приведение к строке – особенность исключительно бинарного оператора "+")
true + false // 1 (true при использовании в арифметических выражениях приводится к единице, false - 0.)
6 / "3"	// 2 (преобразование "3" в число происходит при выполнении математических операций)
"4pt" - 4pt // error
5 && 213 // 213 (&& возвращает последнее "истинное"/true значение, если нет false)
5 || 0 // 5 (|| возвращает первое "истинное"/true значение)
null + 123 // 123 (null преобразуется в 0)
undefined + 10 // NaN (undefined преобразуется в NaN)


5. Без запуску, що виведеться?

var name = "Andrii";
function myName(name) {
	alert(name);
}
myName();  			// undefined
myName("Ivan");		//Ivan
*/


/*6. Напишіть функцію min (a, b), яка повертає більше чисел a, b.
min(1,2)//2
min(23, 3)//23*/

function max(a, b){
	if (a > b){
		return a;
	}return b;
}


/*Напишіть рекурсивну функцію pow (x, n), яка повертає x в ступені n. 
Інакше кажучи, примножує x на себе n разів і повертає результат.
pow(2,2); 2*2 = 4;
pow(2, 5); 2*2*2*2*2 = 32;*/

function pow (x, n){
	if (n == 1){
		return x;
	}
	return x * pow (x, n - 1);
}


/*П.С. У завданнях без запуску, пишіть відповідь в цьому ж рядку як коментар.
ДЗ потрібно запушити у власний репозиторій та надіслати посилання*/
